app/controllers/api/v1/favorites_controller.rb

SELECT "favorites".* FROM "favorites"
---
    def index
        favorites = Favorite.all

INSERT INTO "favorites" ("recipe_id", "user_id", "notes", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["recipe_id", 1], ["user_id", 1], ["notes", "[]"], ["title", "Easy Homemade Wheat Bread"], ["created_at", "2020-01-02 18:55:24.267227"], ["updated_at", "2020-01-02 18:55:24.267227"]]
---
    def create
        favorite = Favorite.create(favorite_params)

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
---
    def show
        favorite = Favorite.find(params[:id])

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 48]]
---
    def destroy
        favorite = Favorite.find(params[:id])
        favorite.destroy

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "favorites" SET "notes" = $1, "updated_at" = $2 WHERE "favorites"."id" = $3  [["notes", "[\"comment\", \"another commnet\", \"sdlkfjskldjf\"]"], ["updated_at", "2020-01-03 16:09:10.954453"], ["id", 6]]
---
    def update
        favorite = Favorite.find(params[:id])
        comments = favorite.notes
        parsed_comments = JSON.parse(comments)
        new_comment = params[:notes]
        parsed_comments << new_comment
        favorite.update(notes: parsed_comments)