app/controllers/api/v1/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "recipes" SET "likes" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["likes", 56], ["updated_at", "2019-12-31 17:58:35.666149"], ["id", 8]]
---
    def update
        recipe = Recipe.find(params[:id])
        recipe.update(recipe_params)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
---
    def show
        recipe = Recipe.find(params[:id])